cclienti/tig-welder/firmware/pic18f2550/src/unpack.c
#include "unpack.h"
#include <xc.h>

static uint8_t unpack1(uint8_t x)
{
    switch(x)
    {
	case 0x00: return 0x00; case 0x01: return 0x01; case 0x02: return 0x04; case 0x03: return 0x05;
	case 0x04: return 0x10; case 0x05: return 0x11; case 0x06: return 0x14; case 0x07: return 0x15;
	case 0x08: return 0x40; case 0x09: return 0x41; case 0x0a: return 0x44; case 0x0b: return 0x45;
	case 0x0c: return 0x50; case 0x0d: return 0x51; case 0x0e: return 0x54; case 0x0f: return 0x55;
	case 0x10: return 0x02; case 0x11: return 0x03; case 0x12: return 0x06; case 0x13: return 0x07;
	case 0x14: return 0x12; case 0x15: return 0x13; case 0x16: return 0x16; case 0x17: return 0x17;
	case 0x18: return 0x42; case 0x19: return 0x43; case 0x1a: return 0x46; case 0x1b: return 0x47;
	case 0x1c: return 0x52; case 0x1d: return 0x53; case 0x1e: return 0x56; case 0x1f: return 0x57;
	case 0x20: return 0x08; case 0x21: return 0x09; case 0x22: return 0x0c; case 0x23: return 0x0d;
	case 0x24: return 0x18; case 0x25: return 0x19; case 0x26: return 0x1c; case 0x27: return 0x1d;
	case 0x28: return 0x48; case 0x29: return 0x49; case 0x2a: return 0x4c; case 0x2b: return 0x4d;
	case 0x2c: return 0x58; case 0x2d: return 0x59; case 0x2e: return 0x5c; case 0x2f: return 0x5d;
	case 0x30: return 0x0a; case 0x31: return 0x0b; case 0x32: return 0x0e; case 0x33: return 0x0f;
	case 0x34: return 0x1a; case 0x35: return 0x1b; case 0x36: return 0x1e; case 0x37: return 0x1f;
	case 0x38: return 0x4a; case 0x39: return 0x4b; case 0x3a: return 0x4e; case 0x3b: return 0x4f;
	case 0x3c: return 0x5a; case 0x3d: return 0x5b; case 0x3e: return 0x5e; case 0x3f: return 0x5f;
	case 0x40: return 0x20; case 0x41: return 0x21; case 0x42: return 0x24; case 0x43: return 0x25;
	case 0x44: return 0x30; case 0x45: return 0x31; case 0x46: return 0x34; case 0x47: return 0x35;
	case 0x48: return 0x60; case 0x49: return 0x61; case 0x4a: return 0x64; case 0x4b: return 0x65;
	case 0x4c: return 0x70; case 0x4d: return 0x71; case 0x4e: return 0x74; case 0x4f: return 0x75;
	case 0x50: return 0x22; case 0x51: return 0x23; case 0x52: return 0x26; case 0x53: return 0x27;
	case 0x54: return 0x32; case 0x55: return 0x33; case 0x56: return 0x36; case 0x57: return 0x37;
	case 0x58: return 0x62; case 0x59: return 0x63; case 0x5a: return 0x66; case 0x5b: return 0x67;
	case 0x5c: return 0x72; case 0x5d: return 0x73; case 0x5e: return 0x76; case 0x5f: return 0x77;
	case 0x60: return 0x28; case 0x61: return 0x29; case 0x62: return 0x2c; case 0x63: return 0x2d;
	case 0x64: return 0x38; case 0x65: return 0x39; case 0x66: return 0x3c; case 0x67: return 0x3d;
	case 0x68: return 0x68; case 0x69: return 0x69; case 0x6a: return 0x6c; case 0x6b: return 0x6d;
	case 0x6c: return 0x78; case 0x6d: return 0x79; case 0x6e: return 0x7c; case 0x6f: return 0x7d;
	case 0x70: return 0x2a; case 0x71: return 0x2b; case 0x72: return 0x2e; case 0x73: return 0x2f;
	case 0x74: return 0x3a; case 0x75: return 0x3b; case 0x76: return 0x3e; case 0x77: return 0x3f;
	case 0x78: return 0x6a; case 0x79: return 0x6b; case 0x7a: return 0x6e; case 0x7b: return 0x6f;
	case 0x7c: return 0x7a; case 0x7d: return 0x7b; case 0x7e: return 0x7e; case 0x7f: return 0x7f;
	case 0x80: return 0x80; case 0x81: return 0x81; case 0x82: return 0x84; case 0x83: return 0x85;
	case 0x84: return 0x90; case 0x85: return 0x91; case 0x86: return 0x94; case 0x87: return 0x95;
	case 0x88: return 0xc0; case 0x89: return 0xc1; case 0x8a: return 0xc4; case 0x8b: return 0xc5;
	case 0x8c: return 0xd0; case 0x8d: return 0xd1; case 0x8e: return 0xd4; case 0x8f: return 0xd5;
	case 0x90: return 0x82; case 0x91: return 0x83; case 0x92: return 0x86; case 0x93: return 0x87;
	case 0x94: return 0x92; case 0x95: return 0x93; case 0x96: return 0x96; case 0x97: return 0x97;
	case 0x98: return 0xc2; case 0x99: return 0xc3; case 0x9a: return 0xc6; case 0x9b: return 0xc7;
	case 0x9c: return 0xd2; case 0x9d: return 0xd3; case 0x9e: return 0xd6; case 0x9f: return 0xd7;
	case 0xa0: return 0x88; case 0xa1: return 0x89; case 0xa2: return 0x8c; case 0xa3: return 0x8d;
	case 0xa4: return 0x98; case 0xa5: return 0x99; case 0xa6: return 0x9c; case 0xa7: return 0x9d;
	case 0xa8: return 0xc8; case 0xa9: return 0xc9; case 0xaa: return 0xcc; case 0xab: return 0xcd;
	case 0xac: return 0xd8; case 0xad: return 0xd9; case 0xae: return 0xdc; case 0xaf: return 0xdd;
	case 0xb0: return 0x8a; case 0xb1: return 0x8b; case 0xb2: return 0x8e; case 0xb3: return 0x8f;
	case 0xb4: return 0x9a; case 0xb5: return 0x9b; case 0xb6: return 0x9e; case 0xb7: return 0x9f;
	case 0xb8: return 0xca; case 0xb9: return 0xcb; case 0xba: return 0xce; case 0xbb: return 0xcf;
	case 0xbc: return 0xda; case 0xbd: return 0xdb; case 0xbe: return 0xde; case 0xbf: return 0xdf;
	case 0xc0: return 0xa0; case 0xc1: return 0xa1; case 0xc2: return 0xa4; case 0xc3: return 0xa5;
	case 0xc4: return 0xb0; case 0xc5: return 0xb1; case 0xc6: return 0xb4; case 0xc7: return 0xb5;
	case 0xc8: return 0xe0; case 0xc9: return 0xe1; case 0xca: return 0xe4; case 0xcb: return 0xe5;
	case 0xcc: return 0xf0; case 0xcd: return 0xf1; case 0xce: return 0xf4; case 0xcf: return 0xf5;
	case 0xd0: return 0xa2; case 0xd1: return 0xa3; case 0xd2: return 0xa6; case 0xd3: return 0xa7;
	case 0xd4: return 0xb2; case 0xd5: return 0xb3; case 0xd6: return 0xb6; case 0xd7: return 0xb7;
	case 0xd8: return 0xe2; case 0xd9: return 0xe3; case 0xda: return 0xe6; case 0xdb: return 0xe7;
	case 0xdc: return 0xf2; case 0xdd: return 0xf3; case 0xde: return 0xf6; case 0xdf: return 0xf7;
	case 0xe0: return 0xa8; case 0xe1: return 0xa9; case 0xe2: return 0xac; case 0xe3: return 0xad;
	case 0xe4: return 0xb8; case 0xe5: return 0xb9; case 0xe6: return 0xbc; case 0xe7: return 0xbd;
	case 0xe8: return 0xe8; case 0xe9: return 0xe9; case 0xea: return 0xec; case 0xeb: return 0xed;
	case 0xec: return 0xf8; case 0xed: return 0xf9; case 0xee: return 0xfc; case 0xef: return 0xfd;
	case 0xf0: return 0xaa; case 0xf1: return 0xab; case 0xf2: return 0xae; case 0xf3: return 0xaf;
	case 0xf4: return 0xba; case 0xf5: return 0xbb; case 0xf6: return 0xbe; case 0xf7: return 0xbf;
	case 0xf8: return 0xea; case 0xf9: return 0xeb; case 0xfa: return 0xee; case 0xfb: return 0xef;
	case 0xfc: return 0xfa; case 0xfd: return 0xfb; case 0xfe: return 0xfe; case 0xff: return 0xff;
    }
    
    return 0;
}

static uint8_t unpack2(uint8_t x)
{
    switch(x)
    {
	case 0x00: return 0x00; case 0x01: return 0x01; case 0x02: return 0x02; case 0x03: return 0x03;
	case 0x04: return 0x10; case 0x05: return 0x11; case 0x06: return 0x12; case 0x07: return 0x13;
	case 0x08: return 0x20; case 0x09: return 0x21; case 0x0a: return 0x22; case 0x0b: return 0x23;
	case 0x0c: return 0x30; case 0x0d: return 0x31; case 0x0e: return 0x32; case 0x0f: return 0x33;
	case 0x10: return 0x04; case 0x11: return 0x05; case 0x12: return 0x06; case 0x13: return 0x07;
	case 0x14: return 0x14; case 0x15: return 0x15; case 0x16: return 0x16; case 0x17: return 0x17;
	case 0x18: return 0x24; case 0x19: return 0x25; case 0x1a: return 0x26; case 0x1b: return 0x27;
	case 0x1c: return 0x34; case 0x1d: return 0x35; case 0x1e: return 0x36; case 0x1f: return 0x37;
	case 0x20: return 0x08; case 0x21: return 0x09; case 0x22: return 0x0a; case 0x23: return 0x0b;
	case 0x24: return 0x18; case 0x25: return 0x19; case 0x26: return 0x1a; case 0x27: return 0x1b;
	case 0x28: return 0x28; case 0x29: return 0x29; case 0x2a: return 0x2a; case 0x2b: return 0x2b;
	case 0x2c: return 0x38; case 0x2d: return 0x39; case 0x2e: return 0x3a; case 0x2f: return 0x3b;
	case 0x30: return 0x0c; case 0x31: return 0x0d; case 0x32: return 0x0e; case 0x33: return 0x0f;
	case 0x34: return 0x1c; case 0x35: return 0x1d; case 0x36: return 0x1e; case 0x37: return 0x1f;
	case 0x38: return 0x2c; case 0x39: return 0x2d; case 0x3a: return 0x2e; case 0x3b: return 0x2f;
	case 0x3c: return 0x3c; case 0x3d: return 0x3d; case 0x3e: return 0x3e; case 0x3f: return 0x3f;
	case 0x40: return 0x40; case 0x41: return 0x41; case 0x42: return 0x42; case 0x43: return 0x43;
	case 0x44: return 0x50; case 0x45: return 0x51; case 0x46: return 0x52; case 0x47: return 0x53;
	case 0x48: return 0x60; case 0x49: return 0x61; case 0x4a: return 0x62; case 0x4b: return 0x63;
	case 0x4c: return 0x70; case 0x4d: return 0x71; case 0x4e: return 0x72; case 0x4f: return 0x73;
	case 0x50: return 0x44; case 0x51: return 0x45; case 0x52: return 0x46; case 0x53: return 0x47;
	case 0x54: return 0x54; case 0x55: return 0x55; case 0x56: return 0x56; case 0x57: return 0x57;
	case 0x58: return 0x64; case 0x59: return 0x65; case 0x5a: return 0x66; case 0x5b: return 0x67;
	case 0x5c: return 0x74; case 0x5d: return 0x75; case 0x5e: return 0x76; case 0x5f: return 0x77;
	case 0x60: return 0x48; case 0x61: return 0x49; case 0x62: return 0x4a; case 0x63: return 0x4b;
	case 0x64: return 0x58; case 0x65: return 0x59; case 0x66: return 0x5a; case 0x67: return 0x5b;
	case 0x68: return 0x68; case 0x69: return 0x69; case 0x6a: return 0x6a; case 0x6b: return 0x6b;
	case 0x6c: return 0x78; case 0x6d: return 0x79; case 0x6e: return 0x7a; case 0x6f: return 0x7b;
	case 0x70: return 0x4c; case 0x71: return 0x4d; case 0x72: return 0x4e; case 0x73: return 0x4f;
	case 0x74: return 0x5c; case 0x75: return 0x5d; case 0x76: return 0x5e; case 0x77: return 0x5f;
	case 0x78: return 0x6c; case 0x79: return 0x6d; case 0x7a: return 0x6e; case 0x7b: return 0x6f;
	case 0x7c: return 0x7c; case 0x7d: return 0x7d; case 0x7e: return 0x7e; case 0x7f: return 0x7f;
	case 0x80: return 0x80; case 0x81: return 0x81; case 0x82: return 0x82; case 0x83: return 0x83;
	case 0x84: return 0x90; case 0x85: return 0x91; case 0x86: return 0x92; case 0x87: return 0x93;
	case 0x88: return 0xa0; case 0x89: return 0xa1; case 0x8a: return 0xa2; case 0x8b: return 0xa3;
	case 0x8c: return 0xb0; case 0x8d: return 0xb1; case 0x8e: return 0xb2; case 0x8f: return 0xb3;
	case 0x90: return 0x84; case 0x91: return 0x85; case 0x92: return 0x86; case 0x93: return 0x87;
	case 0x94: return 0x94; case 0x95: return 0x95; case 0x96: return 0x96; case 0x97: return 0x97;
	case 0x98: return 0xa4; case 0x99: return 0xa5; case 0x9a: return 0xa6; case 0x9b: return 0xa7;
	case 0x9c: return 0xb4; case 0x9d: return 0xb5; case 0x9e: return 0xb6; case 0x9f: return 0xb7;
	case 0xa0: return 0x88; case 0xa1: return 0x89; case 0xa2: return 0x8a; case 0xa3: return 0x8b;
	case 0xa4: return 0x98; case 0xa5: return 0x99; case 0xa6: return 0x9a; case 0xa7: return 0x9b;
	case 0xa8: return 0xa8; case 0xa9: return 0xa9; case 0xaa: return 0xaa; case 0xab: return 0xab;
	case 0xac: return 0xb8; case 0xad: return 0xb9; case 0xae: return 0xba; case 0xaf: return 0xbb;
	case 0xb0: return 0x8c; case 0xb1: return 0x8d; case 0xb2: return 0x8e; case 0xb3: return 0x8f;
	case 0xb4: return 0x9c; case 0xb5: return 0x9d; case 0xb6: return 0x9e; case 0xb7: return 0x9f;
	case 0xb8: return 0xac; case 0xb9: return 0xad; case 0xba: return 0xae; case 0xbb: return 0xaf;
	case 0xbc: return 0xbc; case 0xbd: return 0xbd; case 0xbe: return 0xbe; case 0xbf: return 0xbf;
	case 0xc0: return 0xc0; case 0xc1: return 0xc1; case 0xc2: return 0xc2; case 0xc3: return 0xc3;
	case 0xc4: return 0xd0; case 0xc5: return 0xd1; case 0xc6: return 0xd2; case 0xc7: return 0xd3;
	case 0xc8: return 0xe0; case 0xc9: return 0xe1; case 0xca: return 0xe2; case 0xcb: return 0xe3;
	case 0xcc: return 0xf0; case 0xcd: return 0xf1; case 0xce: return 0xf2; case 0xcf: return 0xf3;
	case 0xd0: return 0xc4; case 0xd1: return 0xc5; case 0xd2: return 0xc6; case 0xd3: return 0xc7;
	case 0xd4: return 0xd4; case 0xd5: return 0xd5; case 0xd6: return 0xd6; case 0xd7: return 0xd7;
	case 0xd8: return 0xe4; case 0xd9: return 0xe5; case 0xda: return 0xe6; case 0xdb: return 0xe7;
	case 0xdc: return 0xf4; case 0xdd: return 0xf5; case 0xde: return 0xf6; case 0xdf: return 0xf7;
	case 0xe0: return 0xc8; case 0xe1: return 0xc9; case 0xe2: return 0xca; case 0xe3: return 0xcb;
	case 0xe4: return 0xd8; case 0xe5: return 0xd9; case 0xe6: return 0xda; case 0xe7: return 0xdb;
	case 0xe8: return 0xe8; case 0xe9: return 0xe9; case 0xea: return 0xea; case 0xeb: return 0xeb;
	case 0xec: return 0xf8; case 0xed: return 0xf9; case 0xee: return 0xfa; case 0xef: return 0xfb;
	case 0xf0: return 0xcc; case 0xf1: return 0xcd; case 0xf2: return 0xce; case 0xf3: return 0xcf;
	case 0xf4: return 0xdc; case 0xf5: return 0xdd; case 0xf6: return 0xde; case 0xf7: return 0xdf;
	case 0xf8: return 0xec; case 0xf9: return 0xed; case 0xfa: return 0xee; case 0xfb: return 0xef;
	case 0xfc: return 0xfc; case 0xfd: return 0xfd; case 0xfe: return 0xfe; case 0xff: return 0xff;
    }
    
    return 0;
}

uint8_t unpack4_high(uint8_t x, uint8_t y)
{
    uint8_t a = x & 0xf0;
    uint8_t b = y & 0xf0;
    b = (uint8_t) ((b >> 4)) | ((uint8_t) (b << 4));
    return a | b;
}

uint8_t unpack4_low(uint8_t x, uint8_t y)
{
    uint8_t a = x & 0x0f;
    uint8_t b = y & 0x0f;
    a = (uint8_t) ((a >> 4)) | (uint8_t) ((a << 4));
    return a | b;
}

uint8_t unpack1_high(uint8_t x, uint8_t y)
{
    x = unpack4_high(x, y);
    return unpack1(x);
}

uint8_t unpack1_low(uint8_t x, uint8_t y)
{
    x = unpack4_low(x, y);
    return unpack1(x); 
}

uint8_t unpack2_high(uint8_t x, uint8_t y)
{
    x = unpack4_high(x, y);
    return unpack2(x);     
}

uint8_t unpack2_low(uint8_t x, uint8_t y)
{
    x = unpack4_low(x, y);
    return unpack2(x);     
}
